2ºSemestre/CSI/ES/Pratica-II/PD2/dss-demonstrations/dss-demo-webapp/src/main/resources/CCMovelDigitalSignature.svc

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="CCMovelDigitalSignature" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:i0="http://Ama.Authentication.Service/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://tempuri.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsp:Policy wsu:Id="BasicHttpBinding_CCMovelSignature_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:import namespace="http://Ama.Authentication.Service/" location="https://cmd.autenticacao.gov.pt/Ama.Authentication.Frontend/CCMovelDigitalSignature.svc?wsdl=wsdl0"/><wsdl:types/><wsdl:binding name="BasicHttpBinding_CCMovelSignature" type="i0:CCMovelSignature"><wsp:PolicyReference URI="#BasicHttpBinding_CCMovelSignature_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="CCMovelSign"><soap:operation soapAction="http://Ama.Authentication.Service/CCMovelSignature/CCMovelSign" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetCertificate"><soap:operation soapAction="http://Ama.Authentication.Service/CCMovelSignature/GetCertificate" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ValidateOtp"><soap:operation soapAction="http://Ama.Authentication.Service/CCMovelSignature/ValidateOtp" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CCMovelMultipleSign"><soap:operation soapAction="http://Ama.Authentication.Service/CCMovelSignature/CCMovelMultipleSign" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ForceSMS"><soap:operation soapAction="http://Ama.Authentication.Service/CCMovelSignature/ForceSMS" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetCertificateWithPin"><soap:operation soapAction="http://Ama.Authentication.Service/CCMovelSignature/GetCertificateWithPin" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="CCMovelDigitalSignature"><wsdl:port name="BasicHttpBinding_CCMovelSignature" binding="tns:BasicHttpBinding_CCMovelSignature"><soap:address location="https://cmd.autenticacao.gov.pt/Ama.Authentication.Frontend/CCMovelDigitalSignature.svc"/></wsdl:port></wsdl:service></wsdl:definitions>